## Pandas

Data Frames | Data Series | Operations in Pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
#playing with DataFrames

In [3]:
df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=["column1","column2","column3","column4"])

In [4]:
df.head()

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [5]:
pd.DataFrame?

In [6]:
Data=pd.DataFrame(np.arange(0,20).reshape(5,4),index=np.arange(1,6))

In [7]:
Data

    0   1   2   3
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15
5  16  17  18  19

In [8]:
df.head()

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [9]:
#accessing the Elements

In [10]:
df.to_csv('Test1.csv')

In [11]:
type(df.loc['Row1'])

pandas.core.series.Series

In [12]:
df.loc['Row1']

column1    0
column2    1
column3    2
column4    3
Name: Row1, dtype: int32

In [13]:
df.iloc[:,:]

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [14]:
type(df.iloc[:,:])

pandas.core.frame.DataFrame

In [15]:
#take elements from column2

In [16]:
df.iloc[:,1:]

      column2  column3  column4
Row1        1        2        3
Row2        5        6        7
Row3        9       10       11
Row4       13       14       15
Row5       17       18       19

In [17]:
df.iloc[1,1]

5

In [18]:
type(df.iloc[:,1])

pandas.core.series.Series

In [19]:
type(df.iloc[:,1:2])

pandas.core.frame.DataFrame

In [20]:
df.iloc[:,1:2]

      column2
Row1        1
Row2        5
Row3        9
Row4       13
Row5       17

In [21]:
df.iloc[:,1]

Row1     1
Row2     5
Row3     9
Row4    13
Row5    17
Name: column2, dtype: int32

In [22]:
#Convert DataFrames into array, this will skip row and column names

In [23]:
df.iloc[:,:].values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [24]:
df.shape

(5, 4)

In [25]:
#checking null values

In [26]:
df.isnull()

      column1  column2  column3  column4
Row1    False    False    False    False
Row2    False    False    False    False
Row3    False    False    False    False
Row4    False    False    False    False
Row5    False    False    False    False

In [27]:
df.isnull().sum()

column1    0
column2    0
column3    0
column4    0
dtype: int64

In [28]:
df['column1'].value_counts()

0     1
4     1
8     1
12    1
16    1
Name: column1, dtype: int64

In [29]:
df['column1'].unique()

array([ 0,  4,  8, 12, 16])

In [30]:
#to fetch multiple columns, put it in a list " ['Column1','Column2']

In [33]:
df[['column2','column1']]

      column2  column1
Row1        1        0
Row2        5        4
Row3        9        8
Row4       13       12
Row5       17       16

In [34]:
df=pd.read_csv('mercedesbenz.csv')

In [35]:
df

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
1,6,88.53,k,t,av,e,d,y,l,o,...,1,0,0,0,0,0,0,0,0,0
2,7,76.26,az,w,n,c,d,x,j,x,...,0,0,0,0,0,0,1,0,0,0
3,9,80.62,az,t,n,f,d,x,l,e,...,0,0,0,0,0,0,0,0,0,0
4,13,78.02,az,v,n,f,d,h,d,n,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4204,8405,107.39,ak,s,as,c,d,aa,d,q,...,1,0,0,0,0,0,0,0,0,0
4205,8406,108.77,j,o,t,d,d,aa,h,h,...,0,1,0,0,0,0,0,0,0,0
4206,8412,109.22,ak,v,r,a,d,aa,g,e,...,0,0,1,0,0,0,0,0,0,0
4207,8415,87.48,al,r,e,f,d,aa,l,u,...,0,0,0,0,0,0,0,0,0,0
4208,8417,110.85,z,r,ae,c,d,aa,g,w,...,1,0,0,0,0,0,0,0,0,0

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4209 entries, 0 to 4208
Columns: 378 entries, ID to X385
dtypes: float64(1), int64(369), object(8)
memory usage: 12.1+ MB

In [38]:
df.describe()

,ID,y,X10,X11,X12,X13,X14,X15,X16,X17,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
count,4209.000000,4209.000000,4209.000000,4209.0,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,...,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000
mean,4205.960798,100.669318,0.013305,0.0,0.075077,0.057971,0.428130,0.000475,0.002613,0.007603,...,0.318841,0.057258,0.314802,0.020670,0.009503,0.008078,0.007603,0.001663,0.000475,0.001426
std,2437.608688,12.679381,0.114590,0.0,0.263547,0.233716,0.494867,0.021796,0.051061,0.086872,...,0.466082,0.232363,0.464492,0.142294,0.097033,0.089524,0.086872,0.040752,0.021796,0.037734
min,0.000000,72.110000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2095.000000,90.820000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,4220.000000,99.150000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,6314.000000,109.010000,0.000000,0.0,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,...,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
max,8417.000000,265.320000,1.000000,0.0,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [39]:
df['X1'].unique()

array(['v', 't', 'w', 'b', 'r', 'l', 's', 'aa', 'c', 'a', 'e', 'h', 'z',
       'j', 'o', 'u', 'p', 'n', 'i', 'y', 'd', 'f', 'm', 'k', 'g', 'q',
       'ab'], dtype=object)

In [40]:
df['X1'].value_counts()

aa    833
s     598
b     592
l     590
v     408
r     251
i     203
a     143
c     121
o      82
w      52
z      46
u      37
e      33
m      32
t      31
h      29
y      23
f      23
j      22
n      19
k      17
p       9
g       6
d       3
q       3
ab      3
Name: X1, dtype: int64

In [42]:
df1=pd.read_csv('test1.csv')

In [44]:
df1

  Unnamed: 0  column1  column2  column3  column4
0       Row1        0        1        2        3
1       Row2        4        5        6        7
2       Row3        8        9       10       11
3       Row4       12       13       14       15
4       Row5       16       17       18       19

In [45]:
df['X0'].value_counts()

z     360
ak    349
y     324
ay    313
t     306
x     300
o     269
f     227
n     195
w     182
j     181
az    175
aj    151
s     106
ap    103
h      75
d      73
al     67
v      36
af     35
m      34
ai     34
e      32
ba     27
at     25
a      21
ax     19
aq     18
am     18
i      18
u      17
aw     16
l      16
ad     14
au     11
k      11
b      11
r      10
as     10
bc      6
ao      4
c       3
aa      2
q       2
ac      1
g       1
ab      1
Name: X0, dtype: int64

In [46]:
df[df['y']>100]

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
6,24,128.76,al,r,e,f,d,f,h,s,...,0,0,0,0,0,0,0,0,0,0
8,27,108.67,w,s,as,e,d,f,i,h,...,1,0,0,0,0,0,0,0,0,0
9,30,126.99,j,b,aq,c,d,f,a,e,...,0,0,1,0,0,0,0,0,0,0
10,31,102.09,h,r,r,f,d,f,h,p,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4202,8402,123.34,ap,l,s,c,d,aa,d,r,...,0,0,0,0,0,0,0,0,0,0
4204,8405,107.39,ak,s,as,c,d,aa,d,q,...,1,0,0,0,0,0,0,0,0,0
4205,8406,108.77,j,o,t,d,d,aa,h,h,...,0,1,0,0,0,0,0,0,0,0
4206,8412,109.22,ak,v,r,a,d,aa,g,e,...,0,0,1,0,0,0,0,0,0,0
4208,8417,110.85,z,r,ae,c,d,aa,g,w,...,1,0,0,0,0,0,0,0,0,0

In [51]:
from io import StringIO, BytesIO

In [62]:
data=('col1,col2,col3,col4\n'
     'x,y,z,1\n'
     '1,2,3,1d\n'
     'a,b,c,d')

In [63]:
type(data)

str

In [65]:
pd.read_csv(StringIO(data))

  col1 col2 col3 col4
0    x    y    z    1
1    1    2    3   1d
2    a    b    c    d

In [66]:
df=pd.read_csv(StringIO(data),usecols=['col1','col3'])

In [67]:
df

  col1 col3
0    x    z
1    1    3
2    a    c

In [68]:
df.to_csv('test.csv')

In [69]:
df=pd.read_csv(StringIO(data),dtype=object) #object datatype makes the values as strings

In [70]:
df

  col1 col2 col3 col4
0    x    y    z    1
1    1    2    3   1d
2    a    b    c    d

In [77]:
df['col1'][0]

'x'

In [78]:
# the above example returns string

In [79]:
#defining different data types for each column

In [81]:
from io import StringIO,BytesIO

In [85]:
data=('a,b,c,d\n'
     '1,2,3,4\n'
     '5,6,7,8\n'
     '11,12,13,14\n')

In [86]:
df=pd.read_csv(StringIO(data),dtype={'a':int,'b':float,'c':'int64'})

In [87]:
df

    a     b   c   d
0   1   2.0   3   4
1   5   6.0   7   8
2  11  12.0  13  14

In [88]:
type(df['a'][1])

numpy.int32

In [89]:
type(df['c'][1])

numpy.int64

In [90]:
df=pd.read_csv(StringIO(data),index_col=0)

In [91]:
df

     b   c   d
a
1    2   3   4
5    6   7   8
11  12  13  14

In [92]:
df=pd.read_csv(StringIO(data),index_col=2)

In [93]:
df

     a   b   d
c
3    1   2   4
7    5   6   8
13  11  12  14

In [94]:
df=pd.read_csv(StringIO(data),index_col=False)

In [95]:
df

    a   b   c   d
0   1   2   3   4
1   5   6   7   8
2  11  12  13  14

In [96]:
data=('a,b,c\n'
     '4,apple,bat,\n'
     '9,orange,cow,')

In [97]:
pd.read_csv(StringIO(data))

        a    b   c
4   apple  bat NaN
9  orange  cow NaN

In [99]:
pd.read_csv(StringIO(data),index_col=False)

   a       b    c
0  4   apple  bat
1  9  orange  cow

In [100]:
pd.read_csv(StringIO(data),index_col=0)

        a    b   c
4   apple  bat NaN
9  orange  cow NaN

In [102]:
pd.read_csv(StringIO(data),index_col=2)

     a       b   c
bat  4   apple NaN
cow  9  orange NaN

In [104]:
pd.read_csv(StringIO(data),index_col=False,usecols=['b','c'])

        b    c
0   apple  bat
1  orange  cow

In [105]:
data='a,b\b"Hello, \\"bob\\", nice to see you",5'

In [107]:
pd.read_csv(StringIO(data))

Empty DataFrame
Columns: [a, b"Hello,  \"bob\",  nice to see you", 5]
Index: []

In [109]:
pd.read_csv(StringIO(data),escapechar='\\')

Empty DataFrame
Columns: [a, b"Hello,  "bob",  nice to see you", 5]
Index: []